# Задача 5.9.4

Повторите задачу с транспонированием прямоугольной матрицы с помощью list comprehension, изложенной в видео-уроке к этой практике. На вход поступает таблица целых чисел, на выходе нужно отобразить эту же таблицу в транспонированном виде (строки заменяются на столбцы), используя команду:

```python
for row in A:
    print(*row)
```

где A - транспонированный двумерный список. Желательно сделать эту задачу не пересматривая видео.

P. S. Для считывания списка целиком в программе уже записаны начальные строчки.

Sample Input:

```python
1 2 3
4 5 6
7 8 9
5 4 3
```

Sample Output:

```python
1 4 7 5
2 5 8 4
3 6 9 3
```

Напишите программу. Тестируется через stdin → stdout
