"""Цикл for. - 1. Вывод чисел от 0 до N."""

"""Пользователь вводит число N. Выведите все числа от 0 до N
включительно.
"""

N = int(input('Введите число: '))

for a in range(N + 1):
    print(a)
